import math

text_art = """
╔════╗╔═══╗╔══╗╔════╗╔══╗╔╗─╔╗╔═══╗───╔══╗╔══╗───╔══╗╔╗─╔╗╔══╗╔══╗╔═══╗╔╗──╔╗╔══╗╔════╗╔══╗╔══╗╔╗─╔╗───╔══╗╔╗╔╗╔══╗╔════╗╔═══╗╔╗──╔╗╔══╗───╔╗──╔═══╗─╔╗
╚═╗╔═╝║╔══╝║╔═╝╚═╗╔═╝╚╗╔╝║╚═╝║║╔══╝───║╔╗║║╔═╝───╚╗╔╝║╚═╝║║╔═╝║╔╗║║╔═╗║║║──║║║╔╗║╚═╗╔═╝╚╗╔╝║╔╗║║╚═╝║───║╔═╝║║║║║╔═╝╚═╗╔═╝║╔══╝║║──║║║╔═╝───║║──║╔═╗║╔╝║
──║║──║╚══╗║╚═╗──║║───║║─║╔╗─║║║╔═╗───║║║║║╚═╗────║║─║╔╗─║║╚═╗║║║║║╚═╝║║╚╗╔╝║║╚╝║──║║───║║─║║║║║╔╗─║───║╚═╗║╚╝║║╚═╗──║║──║╚══╗║╚╗╔╝║║╚═╗───║║──║╚═╝║╚╗║
──║║──║╔══╝╚═╗║──║║───║║─║║╚╗║║║╚╗║───║║║║║╔═╝────║║─║║╚╗║║╔═╝║║║║║╔╗╔╝║╔╗╔╗║║╔╗║──║║───║║─║║║║║║╚╗║───╚═╗║╚═╗║╚═╗║──║║──║╔══╝║╔╗╔╗║╚═╗║───║║──║╔╗╔╝─║║
──║║──║╚══╗╔═╝║──║║──╔╝╚╗║║─║║║╚═╝║───║╚╝║║║─────╔╝╚╗║║─║║║║──║╚╝║║║║║─║║╚╝║║║║║║──║║──╔╝╚╗║╚╝║║║─║║───╔═╝║─╔╝║╔═╝║──║║──║╚══╗║║╚╝║║╔═╝║───║╚═╗║║║║──║║
──╚╝──╚═══╝╚══╝──╚╝──╚══╝╚╝─╚╝╚═══╝───╚══╝╚╝─────╚══╝╚╝─╚╝╚╝──╚══╝╚╝╚╝─╚╝──╚╝╚╝╚╝──╚╝──╚══╝╚══╝╚╝─╚╝───╚══╝─╚═╝╚══╝──╚╝──╚═══╝╚╝──╚╝╚══╝───╚══╝╚╝╚╝──╚╝
"""

# Открытие файла для записи в кодировке UTF-8
with open("результаты.txt", "w", encoding="utf-8") as file:
    equation_number = 1  # Счетчик уравнений
    file.write(text_art)
    while True:
        # Ввод коэффициентов с клавиатуры
        a = float(input(f"Укажите переменную a для {equation_number} уравнения: "))
        b = float(input(f"Укажите переменную b для {equation_number} уравнения: "))
        c = float(input(f"Укажите переменную c для {equation_number} уравнения: "))

        file.write("_____________________________________________________________________________________________\n")
        file.write(f"|Результаты решения {equation_number} уравнения:                                                            |\n")
        file.write("_____________________________________________________________________________________________\n")
        file.write("|   Переменная a   |   Переменная b   |   Переменная c   |   Дискриминант   |   Решение     |\n")
        file.write("|------------------|------------------|------------------|------------------|---------------|\n")

        # Вычисление дискриминанта
        D = b**2 - 4*a*c

        # Запись введенных пользователем коэффициентов
        file.write(f"| {a:.2f}             | {b:.2f}             | {c:.2f}             | {D:.2f}             | ")
        
        if a == 0:
            if b == 0:
                if c == 0:
                    file.write("Бесконечное множество решений |\n")
                else:
                    file.write("Нет действительных корней |\n")
            else:
                x = -c / b
                file.write(f"x = {x:.2f} |\n")
        elif D > 0:
            x1 = (-b + math.sqrt(D)) / (2*a)
            x2 = (-b - math.sqrt(D)) / (2*a)
            file.write(f"x1 = {x1:.2f}, x2 = {x2:.2f} |\n")
        elif D == 0:
            x1 = -b / (2*a)
            file.write(f"x = {x1:.2f} |\n")
        else:
            file.write("Нет действительных корней |\n")

        choice = input("Введите 'y' если это всё, или 'n' для ввода следующего уравнения: ")
        if choice.lower() == 'y':
            break
        elif choice.lower() == 'n':
            equation_number += 1

print("Результаты были записаны в файл 'результаты.txt'")
